stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  if(!twoWire.begin()){
    webSerial("Wire failed to begin\n");
    return false;
  }
  byte error, address;
  int nDevices;

  webSerial("Scanning...\n");

  twoWire.beginTransmission(0x20);
  error = twoWire.endTransmission();
  if (error == 0)
  {
    webSerial("MCP23017 found at address 0x20  !\n");
    espData.program.mcpState = 1;
  }
  else 
  {
    webSerial("MCP23017 not found at address 0x20\n");
    espData.program.mcpState = 2;
  }
  
  twoWire.beginTransmission(0x48);
  error = twoWire.endTransmission();
  if (error == 0)
  {
    webSerial("ADS1115 found at address 0x48  !\n");
    espData.program.adsState = 1;
  }
  else 
  {
    webSerial("ADS1115 not found at address 0x48\n");
    espData.program.adsState = 2;
  }
  if (espData.program.mcpState == 2 || espData.program.adsState == 2){
    return false;
  } else {
    return true;
  }
  
}

#pragma region OTA
// const char *errtext(int code)
// {
// 	switch(code)
// 	{
// 		case ESP32OTAPull::UPDATE_AVAILABLE:
// 			return "An update is available but wasn't installed";
// 		case ESP32OTAPull::NO_UPDATE_PROFILE_FOUND:
// 			return "No profile matches";
// 		case ESP32OTAPull::NO_UPDATE_AVAILABLE:
// 			return "Profile matched, but update not applicable";
// 		case ESP32OTAPull::UPDATE_OK:
// 			return "An update was done, but no reboot";
// 		case ESP32OTAPull::HTTP_FAILED:
// 			return "HTTP GET failure";
// 		case ESP32OTAPull::WRITE_ERROR:
// 			return "Write error";
// 		case ESP32OTAPull::JSON_PROBLEM:
// 			return "Invalid JSON";
// 		case ESP32OTAPull::OTA_UPDATE_FAIL:
// 			return "Update fail (no OTA partition?)";
// 		default:
// 			if (code > 0)
// 				return "Unexpected HTTP response code";
// 			break;
// 	}
// 	return "Unknown error";
// }

// void OtaPullCallback(int offset, int totallength)
// {
// 	Serial.printf("Updating %d of %d (%02d%%)...\r", offset, totallength, 100 * offset / totallength);
// }

// void softwareUpdate(){
//   char basePath[] = "/%s/Releases/OTA_Config.json";
//   char CONFIG_URL[150];
//   sprintf(CONFIG_URL, basePath, NAME);
//   Serial.println(CONFIG_URL);
//   char SERVER[150];
//   sprintf(SERVER, "http://%d.%d.%d.%d:%d",espData.wifiCfg.ips[0],espData.wifiCfg.ips[1],espData.wifiCfg.ips[2],espData.otaCfg.ipAddr,espData.otaCfg.port);
//   Serial.print("CONFIG_URL: ");
//   Serial.println(CONFIG_URL);
//   Serial.print("SERVER: ");
//   Serial.println(SERVER);
  
//   ota.SetConfig(NAME);
//   ota.SetCallback(OtaPullCallback);
  
//   Serial.printf("We are running version %s of the sketch, Board='%s', Device='%s', IP='%s \n", VERSION, ARDUINO_BOARD, WiFi.macAddress().c_str(),(String)(WiFi.localIP()[3]));
//   Serial.println();
//   // Serial.printf("Checking %s to see if an update is available...\n", CONFIG_URL);
//   Serial.println();
//   int ret = ota.CheckForOTAUpdate(SERVER, CONFIG_URL, VERSION);
//   Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
// }

#pragma endregion

#pragma region Webserver

// Function to serve the file list as JSON
void handleFileList(AsyncWebServerRequest *request) {
  JsonDocument doc;
  JsonArray array = doc.to<JsonArray>();

  // Open LittleFS root directory and list files
  File root = LittleFS.open("/");
  File file = root.openNextFile();
  
  while (file) {
    JsonObject fileObject = array.add<JsonObject>();
    fileObject["name"] = String(file.name());
    fileObject["size"] = file.size();
    file = root.openNextFile();
  }

  String jsonResponse;
  serializeJson(doc, jsonResponse);
  request->send(200, "application/json", jsonResponse);
  Serial.println("Sent File List");
}

// File download handler
void handleFileDownload(AsyncWebServerRequest *request) {
  if (request->hasParam("filename")) {
    String filename = request->getParam("filename")->value();
    if (LittleFS.exists("/" + filename)) {
      request->send(LittleFS, "/" + filename, "application/octet-stream");
    } else {
      request->send(404, "text/plain", "File not found");
    }
  } else {
    request->send(400, "text/plain", "Filename not provided");
  }
}

void handleWASzero(AsyncWebServerRequest *request) {
  // espSteer.was.zeroSteerAngle();
  espData.steer.wasZeroAngle = espData.steer.absAngle;
  Serial.println(espData.steer.absAngle);
  Serial.println(espData.steer.wasZeroAngle);
  Serial.println("WAS zeroed");
  uint8_t res = espData.saveWASzero();
  if (res == 1){
    request->send(200, "text/plain", "WAS zeroed and saved to config.json");
  } else {
    request->send(200, "text/plain", "WAS zeroed");
  }
}

static bool fwUpdateSkip = false;

void handleFirmwareUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
    fwUpdateSkip = false;
    Serial.printf("Update Start: %s\n", filename.c_str());
    if (!filename.startsWith(NAME)) {
      Serial.printf("Firmware rejected: filename '%s' does not match module '%s'\n", filename.c_str(), NAME);
      fwUpdateSkip = true;
    } else if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { // Start with max available size
      Update.printError(Serial);
    }
  }

  if (fwUpdateSkip) {
    if (final) {
      request->send(400, "text/plain", "Wrong firmware file! Expected a file starting with: " + String(NAME));
    }
    return;
  }
  
  // Write the received data to the flash memory
  if (Update.write(data, len) != len) {
    Update.printError(Serial);
  }

  // If the upload is complete
  if (final) {
    if (Update.end(true)) { // True to set the size correctly
      Serial.printf("Update Success: %u bytes\n", index + len);
      request->send(200, "text/html", "Update complete! Rebooting...");
      delay(1000);
      ESP.restart();
    } else {
      Update.printError(Serial);
      request->send(500, "text/html", "Update failed.");
    }
  }
}


/**
 * @brief Updates the debug variables vector with current system status information
 * 
 * @details This function clears and repopulates the debugVars vector with real-time
 *          system information including:
 *          - Program name, version, and uptime
 *          - Memory usage and heap information
 *          - WiFi connection status and IP address
 *          - Hardware component states (MCP23017, ADS1115, IMU)
 *          - GPS data (position, satellites, fix quality)
 *          - Steering system status and configuration
 *          - Power management information
 *          Used for web interface diagnostics and system monitoring
 */
void updateDebugVars() {
  // Check available heap before proceeding
  uint32_t freeHeap = ESP.getFreeHeap();
  if (freeHeap < 30000) {
    webSerial("Skipping debug update - low memory: " + String(freeHeap) + " bytes\n");
    debugVars.clear();
    debugVars.push_back("Low Memory - Debug Disabled");
    debugVars.push_back("Free Heap: " + String(freeHeap) + " bytes");
    return;
  }
  
  // Reserve capacity to avoid multiple reallocations
  debugVars.clear();
  
  // Check if minimal debug mode is enabled
  if (!fullDebugMode) {
    // Minimal debug mode - only show basic info
    Serial.println("DEBUG: Using minimal debug mode");
    debugVars.reserve(3);
    debugVars.push_back("Program: " + String(NAME));
    debugVars.push_back("Timestamp since boot [s]: " + String((float)(millis())/1000.0, 2));
    return;
  }
  
  // Full debug mode - show all variables
  Serial.println("DEBUG: Using full debug mode");
  debugVars.reserve(40); // Reduced from 80 to minimize memory usage
  
  webSerial("Updating normal mode debug variables...\n");
  
  // Basic system info
  debugVars.push_back("Program: " + String(NAME));
  debugVars.push_back("Timestamp since boot [s]: " + String((float)(millis())/1000.0, 2));
  debugVars.push_back("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
  debugVars.push_back("Version: " + String(VERSION));
  
  // WiFi info  
  debugVars.push_back("Wifi SSID: " + WiFi.SSID());
  debugVars.push_back("IP Address: " + String(espData.wifi.ips[0])+"."+String(espData.wifi.ips[1])+"."+String(espData.wifi.ips[2])+"."+String(espData.wifi.ips[3]));
  debugVars.push_back("Wifi State: " + String(espData.wifi.state) + " (" + (espData.wifi.state == 1 ? "Connected" : "Disconnected") + ")");
  debugVars.push_back("Program State: " + String(espData.program.state));
  
  // I2C device status
  debugVars.push_back("MCP23017 State: " + String(espData.program.mcpState));
  debugVars.push_back("ADS1115 State: " + String(espData.program.adsState));
  debugVars.push_back("MCP Ready: " + String(i2cManager.isMcpReady() ? "Yes" : "No"));
  debugVars.push_back("ADS Ready: " + String(i2cManager.isAdsReady() ? "Yes" : "No"));
  
