stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  // GPS data - simplified to reduce stack usage
  debugVars.push_back("GPS Data: ");
  debugVars.push_back("..GPS Mode: " + String(espData.gps.ntripPandaMode ? "PANDA Generation" : "Raw NMEA"));
  debugVars.push_back("..Fix Time: " + String(espData.gps.fixTime));
  debugVars.push_back("..Fix Quality: " + String(espData.gps.fixQuality));
  debugVars.push_back("..Satellites: " + String(espData.gps.numSats));
  debugVars.push_back("..Latitude: " + String(espData.gps.latitude));
  debugVars.push_back("..Longitude: " + String(espData.gps.longitude));
  debugVars.push_back("..Altitude: " + String(espData.gps.altitude));
  debugVars.push_back("..Speed: " + String(espData.gps.speedKnots));
  debugVars.push_back("..Heading: " + String(espData.gps.vtgHeading));
  debugVars.push_back("..HDOP: " + String(espData.gps.HDOP));
  debugVars.push_back("..Last PANDA: " + String(espData.gps.nmea));
  debugVars.push_back("..Message Counts");
  debugVars.push_back("....GGA: " + String(espData.gps.ggaMessageCount));
  debugVars.push_back("....RMC: " + String(espData.gps.rmcMessageCount));
  debugVars.push_back("....GSA: " + String(espData.gps.gsaMessageCount));
  debugVars.push_back("....VTG: " + String(espData.gps.vtgMessageCount));
  debugVars.push_back("....Other:" + String(espData.gps.otherMessageCount)); 
  debugVars.push_back("....PANDA Sent: " + String(espData.gps.pandaMessageCount));
  debugVars.push_back("..Last PANDA Time: " + String((float)(espData.gps.lastPandaTime)/1000.0, 2) + "s");
  // Calculate and display PANDA message frequency
  if (espData.gps.pandaMessageCount > 1 && espData.gps.firstPandaTime > 0) {
    float elapsedTime = (millis() - espData.gps.firstPandaTime) / 1000.0; // Convert to seconds
    float frequency = (espData.gps.pandaMessageCount - 1) / elapsedTime; // Messages per second
    debugVars.push_back("..PANDA Frequency: " + String(frequency, 2) + " Hz");
  } else {
    debugVars.push_back("..PANDA Frequency: N/A");
  } 
  debugVars.push_back("..IMU State: " + String(espData.gps.imuState));
  debugVars.push_back("....IMU Heading: " + String(espData.gps.imuHeading));
  debugVars.push_back("....IMU Pitch: " + String(espData.gps.imuPitch));
  debugVars.push_back("....IMU Roll: " + String(espData.gps.imuRoll));
  // NTRIP correction data statistics
  debugVars.push_back("..NTRIP Data: ");
  debugVars.push_back("....Packets Received: " + String(espData.gps.ntripPacketCount));
  debugVars.push_back("....Total Bytes: " + String(espData.gps.ntripTotalBytes));
  debugVars.push_back("....Last Packet Time: " + String((float)(espData.gps.lastNtripTime)/1000.0, 2) + "s");
  // Calculate and display NTRIP packet frequency
  if (espData.gps.ntripPacketCount > 1 && espData.gps.firstNtripTime > 0) {
    float elapsedTime = (millis() - espData.gps.firstNtripTime) / 1000.0;
    float frequency = (espData.gps.ntripPacketCount - 1) / elapsedTime;
    debugVars.push_back("....Packet Frequency: " + String(frequency, 2) + " Hz");
    if (espData.gps.ntripTotalBytes > 0) {
      float bytesPerSec = espData.gps.ntripTotalBytes / elapsedTime;
      debugVars.push_back("....Data Rate: " + String(bytesPerSec, 1) + " B/s");
    }
  } else {
    debugVars.push_back("....Packet Frequency: N/A");
  }
  // Steering data - essential only
  debugVars.push_back("Steer Data: ");
  debugVars.push_back("..Target Angle: " + String(espData.steer.targetSteerAngle, 2));
  debugVars.push_back("..Actual Angle: " + String(espData.steer.actSteerAngle, 2));
  debugVars.push_back("..Raw ADS: " + String(espData.steer.rawADS));
  debugVars.push_back("..PWM Command: " + String(espData.steer.pwmCmd));
  debugVars.push_back("..Switch State: " + String(espData.steer.switchState));
  
  // ADS readings - simplified
  debugVars.push_back("ADS1115 INFO");
  for(int i = 0; i < 4; i++) {
    debugVars.push_back("..Ch" + String(i) + ": " + String(i2cManager.getVoltage(i), 3) + "V");
  }

  // Loop timing diagnostics - confirm ADS read does not block
  debugVars.push_back("Loop Timing Diagnostics:");
  debugVars.push_back("..Steer Loop Time: " + String(espData.steer.looptime) + "ms");
  debugVars.push_back("..I2C Task Cycle Time: " + String(i2cManager.getI2CTaskCycleTime()) + "ms");
  debugVars.push_back("..ADS State Machine Time (last): " + String(i2cManager.getADCStateMachineTime()) + "us");
  debugVars.push_back("..ADS State Machine Time (max): " + String(i2cManager.getADCStateMachineMaxTime()) + "us");
  
  // Add CPU/Task statistics
  getTaskStats(debugVars);
  
}

/**
 * @brief Get FreeRTOS task statistics including CPU usage
 */
void getTaskStats(std::vector<String>& stats) {
  stats.push_back("=== System Statistics ===");
  
  // Get number of tasks
  UBaseType_t taskCount = uxTaskGetNumberOfTasks();
  stats.push_back("Active FreeRTOS tasks: " + String(taskCount));
  stats.push_back("");
  
  // System uptime
  uint32_t uptimeSeconds = millis() / 1000;
  uint32_t days = uptimeSeconds / 86400;
  uint32_t hours = (uptimeSeconds % 86400) / 3600;
  uint32_t minutes = (uptimeSeconds % 3600) / 60;
  uint32_t seconds = uptimeSeconds % 60;
  
  stats.push_back("System Uptime:");
  if (days > 0) {
    stats.push_back("  " + String(days) + " days, " + String(hours) + "h " + String(minutes) + "m " + String(seconds) + "s");
  } else if (hours > 0) {
    stats.push_back("  " + String(hours) + "h " + String(minutes) + "m " + String(seconds) + "s");
  } else {
    stats.push_back("  " + String(minutes) + "m " + String(seconds) + "s");
  }
  stats.push_back("");
  
  // Memory statistics
  stats.push_back("Memory Statistics:");
  stats.push_back("  Free heap: " + String(ESP.getFreeHeap()) + " bytes");
  stats.push_back("  Min free heap: " + String(ESP.getMinFreeHeap()) + " bytes");
  stats.push_back("  Max alloc heap: " + String(ESP.getMaxAllocHeap()) + " bytes");
  
  // Calculate heap fragmentation
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t maxAlloc = ESP.getMaxAllocHeap();
  if (freeHeap > 0) {
    uint32_t fragmentation = 100 - ((maxAlloc * 100) / freeHeap);
    stats.push_back("  Heap fragmentation: " + String(fragmentation) + "%");
  }
  
  // PSRAM if available
  if (ESP.getPsramSize() > 0) {
    stats.push_back("  PSRAM total: " + String(ESP.getPsramSize()) + " bytes");
    stats.push_back("  PSRAM free: " + String(ESP.getFreePsram()) + " bytes");
  }
  stats.push_back("");
  
  // CPU information
  stats.push_back("CPU Information:");
  stats.push_back("  Chip model: " + String(ESP.getChipModel()));
  stats.push_back("  Chip revision: " + String(ESP.getChipRevision()));
  stats.push_back("  CPU cores: " + String(ESP.getChipCores()));
  stats.push_back("  CPU frequency: " + String(ESP.getCpuFreqMHz()) + " MHz");
  stats.push_back("  Flash size: " + String(ESP.getFlashChipSize() / 1024) + " KB");
  stats.push_back("  Flash speed: " + String(ESP.getFlashChipSpeed() / 1000000) + " MHz");
}

/**
 * @brief Updates debug variables specifically for recovery mode display
 * 
 * @details This function populates the debugVars vector with recovery mode
 *          specific information including:
 *          - Recovery mode indicators and timestamps
 *          - Hardware specifications (chip model, CPU frequency, flash)
 *          - Recovery WiFi AP configuration details
 *          - System status and reset reason information
 *          - Memory usage statistics including PSRAM
 *          Used for diagnostics when the system is in recovery mode
 */
void updateRecoveryDebugVars() {
  debugVars.clear(); // Clear the list to update it dynamically
  debugVars.push_back("=== RECOVERY MODE ===");
  debugVars.push_back("Program: " + String(NAME));
  debugVars.push_back("Recovery Boot Timestamp [s]: " + String((float)(millis())/1000.0));
  debugVars.push_back("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
  debugVars.push_back("Used PSRAM: " + String(ESP.getPsramSize() - ESP.getFreePsram()) + " bytes");
  debugVars.push_back("Version: " + String(VERSION));
  debugVars.push_back("Chip Model: " + String(ESP.getChipModel()));
  debugVars.push_back("Chip Revision: " + String(ESP.getChipRevision()));
  debugVars.push_back("CPU Frequency: " + String(ESP.getCpuFreqMHz()) + " MHz");
  debugVars.push_back("Flash Size: " + String(ESP.getFlashChipSize()) + " bytes");
  debugVars.push_back("Flash Speed: " + String(ESP.getFlashChipSpeed()) + " Hz");
  debugVars.push_back("MAC Address: " + WiFi.macAddress());
  debugVars.push_back("");
  debugVars.push_back("=== RECOVERY WIFI ===");
  debugVars.push_back("AP SSID: " + String(NAME) + "_RECOVERY");
  debugVars.push_back("AP Password: recovery123");
  debugVars.push_back("AP IP: 192.168.4.1");
  debugVars.push_back("WiFi Mode: AP (Access Point)");
  debugVars.push_back("Connected Clients: " + String(WiFi.softAPgetStationNum()));
  debugVars.push_back("");
  debugVars.push_back("=== SYSTEM STATUS ===");
  debugVars.push_back("Config Load Result: " + String(espData.program.confRes));
  debugVars.push_back("Program State: " + String(espData.program.state));
  debugVars.push_back("Reset Reason Core 0: " + String(esp_reset_reason()));
  debugVars.push_back("Reset Reason Core 1: " + String(esp_reset_reason()));
  debugVars.push_back("Wake Reason: " + String(esp_sleep_get_wakeup_cause()));
  debugVars.push_back("");
  debugVars.push_back("=== HARDWARE STATUS ===");
  debugVars.push_back("MCP23017 State: " + String(espData.program.mcpState));
  debugVars.push_back("ADS1115 State: " + String(espData.program.adsState));
  debugVars.push_back("IMU State: " + String(espData.gps.imuState));
  debugVars.push_back("I2C0 SDA/SCL: " + String(SDA) + "/" + String(SCL));
  debugVars.push_back("I2C0 SDA/SCL: " + String(espData.pins.SDA_PIN) + "/" + String(espData.pins.SCL_PIN));
  debugVars.push_back("");
  debugVars.push_back("=== FILE SYSTEM ===");
  debugVars.push_back("LittleFS Total: " + String(LittleFS.totalBytes()) + " bytes");
  debugVars.push_back("LittleFS Used: " + String(LittleFS.usedBytes()) + " bytes");
  debugVars.push_back("LittleFS Free: " + String(LittleFS.totalBytes() - LittleFS.usedBytes()) + " bytes");
  debugVars.push_back("");
  
  // Add CPU/Task statistics for recovery mode
  getTaskStats(debugVars);
  
