stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  html += "<div id='status' class='status' style='display: none;'></div>";
  html += "</div>";
  
  // JavaScript
  html += "<script>";
  html += "function showStatus(message, isError) {";
  html += "  const status = document.getElementById('status');";
  html += "  status.textContent = message;";
  html += "  status.className = 'status ' + (isError ? 'error' : 'success');";
  html += "  status.style.display = 'block';";
  html += "  setTimeout(() => status.style.display = 'none', 5000);";
  html += "}";
  
  html += "function loadSettings() {";
  html += "  console.log('Loading settings from server...');";
  html += "  fetch('/getSettings')";
  html += "    .then(response => {";
  html += "      console.log('Settings response status:', response.status);";
  html += "      if (!response.ok) throw new Error('Network response was not ok');";
  html += "      return response.json();";
  html += "    })";
  html += "    .then(data => {";
  html += "      console.log('Settings data received:', data);";
  html += "      document.getElementById('ipAddress').value = data.ip0 + '.' + data.ip1 + '.' + data.ip2 + '.' + data.ip3;";
  html += "      document.getElementById('kp').value = data.kp;";
  html += "      document.getElementById('highPWM').value = data.highPWM;";
  html += "      document.getElementById('lowPWM').value = data.lowPWM;";
  html += "      document.getElementById('minPWM').value = data.minPWM;";
  html += "      document.getElementById('countsPerDeg').value = data.countsPerDeg;";
  html += "      document.getElementById('wasOffset').value = data.wasOffset;";
  html += "      document.getElementById('pidInputFilt').value = data.pidInputFilt;";
  html += "      document.getElementById('pidOutputFilt').value = data.pidOutputFilt;";
  html += "      document.getElementById('useADS').value = data.useADS;";
  html += "      document.getElementById('gpsSource').value = data.gpsSource;";
  html += "      document.getElementById('pandaMode').value = data.pandaMode;";
  html += "      document.getElementById('wasSource').value = data.wasSource;";
  html += "      document.getElementById('ledBrightness').value = data.ledBrightness;";
  html += "      document.getElementById('adsAddress').value = data.adsAddress;";
  html += "      document.getElementById('flipPitchRoll').value = data.flipPitchRoll;";
  html += "      document.getElementById('invertRoll').value = data.invertRoll;";
  html += "      document.getElementById('disableHeading').value = data.disableHeading;";
  html += "      showStatus('Settings loaded successfully', false);";
  html += "    })";
  html += "    .catch(error => { console.log('Settings load error:', error); showStatus('Failed to load settings: ' + error, true); });";
  html += "}";
  
  html += "function saveSettings() {";
  html += "  const ipParts = document.getElementById('ipAddress').value.split('.');";
  html += "  if (ipParts.length !== 4) { showStatus('Invalid IP address format', true); return; }";
  html += "  const formData = new FormData();";
  html += "  formData.append('ip0', parseInt(ipParts[0]) || 192);";
  html += "  formData.append('ip1', parseInt(ipParts[1]) || 168);";
  html += "  formData.append('ip2', parseInt(ipParts[2]) || 1);";
  html += "  formData.append('ip3', parseInt(ipParts[3]) || 100);";
  html += "  formData.append('kp', parseFloat(document.getElementById('kp').value) || 50);";
  html += "  formData.append('highPWM', parseInt(document.getElementById('highPWM').value) || 255);";
  html += "  formData.append('lowPWM', parseInt(document.getElementById('lowPWM').value) || 10);";
  html += "  formData.append('minPWM', parseInt(document.getElementById('minPWM').value) || 5);";
  html += "  formData.append('countsPerDeg', parseFloat(document.getElementById('countsPerDeg').value) || 10);";
  html += "  formData.append('wasOffset', parseInt(document.getElementById('wasOffset').value) || 0);";
  html += "  formData.append('pidInputFilt', parseFloat(document.getElementById('pidInputFilt').value) || 0.1);";
  html += "  formData.append('pidOutputFilt', parseFloat(document.getElementById('pidOutputFilt').value) || 0.1);";
  html += "  formData.append('useADS', document.getElementById('useADS').value);";
  html += "  formData.append('gpsSource', document.getElementById('gpsSource').value);";
  html += "  formData.append('pandaMode', document.getElementById('pandaMode').value);";
  html += "  formData.append('wasSource', document.getElementById('wasSource').value);";
  html += "  formData.append('ledBrightness', parseInt(document.getElementById('ledBrightness').value) || 100);";
  html += "  formData.append('flipPitchRoll', document.getElementById('flipPitchRoll').value);";
  html += "  formData.append('invertRoll', document.getElementById('invertRoll').value);";
  html += "  formData.append('disableHeading', document.getElementById('disableHeading').value);";
  html += "  fetch('/saveSettings', {";
  html += "    method: 'POST',";
  html += "    body: formData";
  html += "  })";
  html += "    .then(response => response.text())";
  html += "    .then(data => showStatus(data, false))";
  html += "    .catch(error => showStatus('Failed to save settings: ' + error, true));";
  html += "}";
  
  html += "function resetToDefaults() {";
  html += "  if (confirm('Reset all settings to defaults? This will require a reboot.')) {";
  html += "    document.getElementById('ipAddress').value = '192.168.1.100';";
  html += "    document.getElementById('kp').value = '50';";
  html += "    document.getElementById('highPWM').value = '255';";
  html += "    document.getElementById('lowPWM').value = '10';";
  html += "    document.getElementById('minPWM').value = '5';";
  html += "    document.getElementById('countsPerDeg').value = '10';";
  html += "    document.getElementById('wasOffset').value = '0';";
  html += "    document.getElementById('pidInputFilt').value = '0.1';";
  html += "    document.getElementById('pidOutputFilt').value = '0.1';";
  html += "    document.getElementById('useADS').value = '1';";
  html += "    document.getElementById('gpsSource').value = '0';";
  html += "    document.getElementById('pandaMode').value = '1';";
  html += "    document.getElementById('wasSource').value = '0';";
  html += "    document.getElementById('ledBrightness').value = '100';";
  html += "    document.getElementById('adsAddress').value = '0x48';";
  html += "    showStatus('Default values loaded - click Save to apply', false);";
  html += "  }";
  html += "}";
  
  html += "window.onload = loadSettings;";
  html += "</script>";
  html += "</body></html>";
  
  Serial.println("Settings page HTML generated, size: " + String(html.length()) + " bytes");
  request->send(200, "text/html", html);
  Serial.println("Settings page sent successfully");
}

// Get current settings as JSON
void handleGetSettings(AsyncWebServerRequest *request) {
  Serial.println("=== GET SETTINGS REQUEST ===");
  Serial.println("Client IP: " + request->client()->remoteIP().toString());
  Serial.println("Preparing settings JSON response...");
  
  JsonDocument doc;
  
  // Network settings
  doc["ip0"] = espData.wifi.ips[0];
  doc["ip1"] = espData.wifi.ips[1];
  doc["ip2"] = espData.wifi.ips[2];
  doc["ip3"] = espData.wifi.ips[3];
  
