stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
    for (const auto& var : debugVars) {
      array.add(var);
    }
    
    String jsonResponse;
    serializeJson(doc, jsonResponse);
    request->send(200, "application/json", jsonResponse);
  });
  
  // Factory reset endpoint
  // server.on("/factoryReset", HTTP_GET, [](AsyncWebServerRequest *request) {
  //   Serial.println("Factory reset requested");
  //   request->send(200, "text/plain", "Factory reset initiated. Device will reboot...");
  //   delay(1000);
  //   LittleFS.format();
  //   ESP.restart();
  // });
  
  // Force normal boot endpoint
  server.on("/forceNormalBoot", HTTP_GET, [](AsyncWebServerRequest *request) {
    Serial.println("Force normal boot requested");
    espData.program.state = 1; // Set to normal boot state
    espData.program.bootcount = 0; // Reset boot count
    espData.saveConfig();
    request->send(200, "text/plain", "Normal boot forced. Device will reboot...");
    delay(1000);
    ESP.restart();
  });
  
  // Recovery-specific debug endpoint to avoid conflicts with normal mode
  server.on("/getRecoveryDebug", HTTP_GET, [](AsyncWebServerRequest *request) {
    updateRecoveryDebugVars();
    JsonDocument doc;
    JsonArray array = doc.to<JsonArray>();
    
    for (const auto& var : debugVars) {
      array.add(var);
    }
    
    String jsonResponse;
    serializeJson(doc, jsonResponse);
    request->send(200, "application/json", jsonResponse);
  });
  
  Serial.println("Registering settings endpoints for recovery mode...");
  server.on("/settings", HTTP_GET, handleSettingsPage);
  server.on("/getSettings", HTTP_GET, handleGetSettings);
  server.on("/saveSettings", HTTP_POST, handleSaveSettings);
  Serial.println("Settings endpoints registered: /settings, /getSettings, /saveSettings");
  server.on("/getFiles", HTTP_GET, handleFileList);
  server.on("/download", HTTP_GET, handleFileDownload);
  server.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFileUpload);
  server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFirmwareUpload);
  server.on("/reboot", HTTP_GET, handleReboot);
  
  // Start the recovery server
  logStartupState("Web Server", "Starting", "Recovery mode");
  server.begin();
  logStartupState("Recovery Mode", "Complete", "Web server started");
  Serial.println("Recovery Web Server started!");
  Serial.println("Connect to WiFi: " + recoverySSID);
  Serial.println("Password: " + String(recoveryPassword));
  Serial.println("Open browser to: http://192.168.4.1");
  Serial.println("=====================================");  
}

/**
 * @brief Executes normal system boot sequence with full hardware initialization
 * 
 * @details Normal boot mode performs complete system startup including:
 *          - Serial port configuration for GPS and IMU communication
 *          - I2C bus initialization and hardware component detection
 *          - Network configuration and WiFi connection establishment
 *          - Web server startup with full feature set
 *          - GPS module initialization and NTRIP client setup
 *          - Steering system calibration and motor driver configuration
 *          - LED indicators and switch interface setup
 * 
 *          This is the primary operational mode providing full system functionality.
 *          All hardware components are initialized and operational services started.
 * 
 * @note Only called when system passes configuration validation checks
 * @see recoveryBoot(), setup(), I2Csetup()
 */
void normalboot(){
  // Normal boot sequence
  /** @brief Normal boot sequence */
  Serial.println("Normal Boot Sequence Initiated");
  logStartupState("Normal Boot", "Started", "");
  
  LittleFS.begin(); // Ensure LittleFS is mounted
  espData.setState(2);
  logStartupState("Program State", "Set to 2", "");
  
  // Start other Serial Ports
  bnoSerial.setPins(espData.pins.BNO_PIN, 10);
  bnoSerial.begin(115200);
  String bnoDetails = "Pin: " + String(espData.pins.BNO_PIN) + ", 115200 baud";
  logStartupState("BNO Serial", "Initialized", bnoDetails.c_str());
  
  gpsSerial.setPins(espData.pins.GPS_RX, espData.pins.GPS_TX);
  gpsSerial.begin(460800);
  String gpsDetails = "RX: " + String(espData.pins.GPS_RX) + ", TX: " + String(espData.pins.GPS_TX) + ", 460800 baud";
  logStartupState("GPS Serial", "Initialized", gpsDetails.c_str());
  
  // Initialize I2C Manager for centralized bus management
  I2Csetup();
  if (i2cManager.begin(&twoWire, espData.i2c.MCP_ADDRESS, espData.i2c.ADS_ADDRESS)) {
    Serial.println("I2CManager initialized successfully");
    String i2cDetails = "MCP: 0x" + String(espData.i2c.MCP_ADDRESS, HEX) + ", ADS: 0x" + String(espData.i2c.ADS_ADDRESS, HEX);
    logStartupState("I2C Manager", "Initialized Successfully", i2cDetails.c_str());
    // Set optimal ADS settings for reduced I2C load
    // i2cManager.adsSetGain(GAIN_TWOTHIRDS);  // +/- 6.144V range
  } else {
    Serial.println("I2CManager initialization failed");
    logStartupState("I2C Manager", "Failed - Restarting", "");
    ESP.restart();
  }
  
  
  // Start GPS
  // Using MCPManager singleton approach (auto-detected when no MCP pointer provided):
 
    // If everything is good, turn on power to autosteer
  Serial.println("starting wifi");
  logStartupState("WiFi", "Starting Connection", "");
  
  if (!FORCE_AP_MODE) {
  uint32_t wifiStart = millis();
  while (WiFi.status() != WL_CONNECTED){
    espData.wifi.state = espWifi.connect();
    /** @brief Check for WiFi connection, if times out, create AP */
    if (millis()-wifiStart > 120000){
      Serial.println("Wifi connection timed out");
      Serial.println("Switching to AP mode");
      logStartupState("WiFi", "Connection Timeout", "Switching to AP mode after 120s");
      espData.wifi.state = espWifi.makeAP();
      break;
    }
  }
} else {
    Serial.println("FORCE_AP_MODE is enabled - Starting in AP mode");
    logStartupState("WiFi", "Forced AP Mode", "FORCE_AP_MODE is true");
    espData.wifi.state = espWifi.makeAP();
  }
  // espData.wifi.state = espWifi.makeAP();
  i2cManager.setEthLED(LEDPattern::ON);
  // espConfig.wifiCfg.state = espWifi.makeAP();
  Serial.println("Wifi State: " + String(espData.wifi.state));
  String wifiDetails = "State: " + String(espData.wifi.state);
  logStartupState("WiFi", espData.wifi.state == 1 ? "Connected" : "AP Mode", wifiDetails.c_str());
  
  // ADD NETWORK READINESS CHECK
  Serial.println("=== NETWORK INITIALIZATION DEBUG ===");
  Serial.println("WiFi Status: " + String(WiFi.status()));
  Serial.println("WiFi Mode: " + String(WiFi.getMode()));
  Serial.println("IP Address: " + WiFi.localIP().toString());
  Serial.println("Gateway: " + WiFi.gatewayIP().toString());
  Serial.println("DNS: " + WiFi.dnsIP().toString());
  
  // Verify WiFi is actually connected before proceeding
  if (WiFi.status() != WL_CONNECTED || WiFi.localIP() == IPAddress(0,0,0,0)) {
    Serial.println("ERROR: WiFi not properly connected! Attempting to fix...");
    
