stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
        <div class='terminal' id='terminal'></div>
    </div>

    <script>
        let ws;
        let terminal = document.getElementById('terminal');
        let status = document.getElementById('status');
        let commandInput = document.getElementById('commandInput');
        
        function connect() {
            const protocol = window.location.protocol === 'https:' ? 'wss:' : 'ws:';
            const wsUrl = protocol + '//' + window.location.host + '/ws';
            
            ws = new WebSocket(wsUrl);
            
            ws.onopen = function() {
                status.textContent = 'Connected';
                status.className = 'status';
                addToTerminal('[' + new Date().toLocaleTimeString() + '] WebSocket Connected\n');
            };
            
            ws.onmessage = function(event) {
                addToTerminal(event.data);
            };
            
            ws.onclose = function() {
                status.textContent = 'Disconnected';
                status.className = 'status disconnected';
                addToTerminal('[' + new Date().toLocaleTimeString() + '] WebSocket Disconnected\n');
                
                // Auto-reconnect after 3 seconds
                setTimeout(connect, 3000);
            };
            
            ws.onerror = function(error) {
                status.textContent = 'Error';
                status.className = 'status disconnected';
                addToTerminal('[' + new Date().toLocaleTimeString() + '] WebSocket Error\n');
            };
        }
        
        function addToTerminal(message) {
            terminal.textContent += message;
            terminal.scrollTop = terminal.scrollHeight;
        }
        
        function sendCommand() {
            const command = commandInput.value.trim();
            if (command && ws && ws.readyState === WebSocket.OPEN) {
                ws.send(command);
                commandInput.value = '';
            }
        }
        
        function sendPredefinedCommand(cmd) {
            if (ws && ws.readyState === WebSocket.OPEN) {
                ws.send(cmd);
            }
        }
        
        function clearTerminal() {
            terminal.textContent = '';
            if (ws && ws.readyState === WebSocket.OPEN) {
                ws.send('clear');
            }
        }
        
        function reconnect() {
            if (ws) {
                ws.close();
            }
            connect();
        }
        
        function handleKeyPress(event) {
            if (event.key === 'Enter') {
                sendCommand();
            }
        }
        
        // Connect on page load
        connect();
        
        // Auto-scroll to bottom
        setInterval(() => {
            terminal.scrollTop = terminal.scrollHeight;
        }, 1000);
    </script>
</body>
</html>
            )";
            
            request->send(200, "text/html", html);
        });
        
        server.on("/toggleAPMode", HTTP_POST, handleToggleAPMode); // Add this line
        // Handle toggle state update
        server.on("/zeroWAS", HTTP_GET, handleWASzero);
        // Start server
        server.on("/Module_Disconnected", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("Sending Module_Disconnected.svg");
          request->send(LittleFS, "/Module_Disconnected.svg", "image/svg+xml");
        });
        server.on("/Module_Connected", HTTP_GET, [](AsyncWebServerRequest *request){
          request->send(LittleFS, "/Module_Connected.svg", "image/svg+xml");
        });
        server.on("/setGpsSource", HTTP_POST, [](AsyncWebServerRequest *request){},
        NULL,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
            JsonDocument doc;
            DeserializationError error = deserializeJson(doc, data, len);
            if (error) {
                request->send(400, "text/plain", "Invalid JSON");
                return;
            }
            String source = doc["source"] | "";
            if (source == "um982") {

                espData.gps.externalGPS = false;
                request->send(200, "text/plain", "UM982 GPS selected");
            } else if (source == "external") {
                espData.gps.externalGPS = true;
                request->send(200, "text/plain", "External GPS selected");
            } else {
                request->send(400, "text/plain", "Unknown GPS source");
            }
        }
    );
        // server.on("/isConnected", HTTP_GET, [](AsyncWebServerRequest *request){
        //   request->send(LittleFS, "/Modu.svg", "image/svg+xml");
        // });
        logStartupState("Web Server", "Starting", "Normal mode");
        server.begin();
        logStartupState("Web Server", "Complete", "Started successfully");
      #pragma endregion
  
  logStartupState("System Boot", "Complete", "Entering normal operation");
  espData.setState(1);
  espData.setBootCount(0);
  // Add your normal boot logic here
}

/**
 * @brief Main Arduino setup function - system initialization entry point
 * 
 * @details This is the primary system initialization function that:
 *          - Initializes serial communication and LED task scheduler
 *          - Loads system configuration from NVS storage
 *          - Determines boot mode based on configuration state and boot count
 *          - Routes to either recoveryBoot() or normalboot() based on system health
 *          - Implements recovery mode fallback for corrupted configurations
 * 
 *          Boot mode selection logic:
 *          - Recovery mode: If config invalid AND boot count > 2
 *          - Normal mode: If configuration loads successfully
 * 
 * @note Called once by Arduino framework at system startup
 * @see loop(), recoveryBoot(), normalboot()
 */
void setup(){
  Serial.begin(115200);
  myLED.startTask();
  myLED.setLEDState(LEDState::SPECIAL_MODE);
  // myLED.setLEDState(LEDState::NO_ERROR);
  delay(1000); // Give time for serial to initialize
  Serial.println("\n\nStarting up...");
  
  // Initialize LittleFS first for startup logging
  if (!LittleFS.begin(true)) {
    Serial.println("LittleFS Mount Failed");
  }
  
  // Start new startup log session
  writeStartupLog("System startup initiated", true);
  logStartupState("Serial", "Initialized", "115200 baud");
  logStartupState("LED Controller", "Started", "Special mode");
  
  espData.program.confRes = espData.loadConfig();
  String confDetails = "Result: " + String(espData.program.confRes);
  logStartupState("Configuration", espData.program.confRes == 0 ? "Loaded Successfully" : "Load Failed", confDetails.c_str());
  
  // Update LED brightness from loaded configuration
  myLED.updateBrightness();
  Serial.println("LED brightness set to: " + String(espData.program.ledBrht));
  String ledDetails = "Set to " + String(espData.program.ledBrht);
  logStartupState("LED Brightness", "Updated", ledDetails.c_str());
  
  if (espData.program.state != 1 && espData.program.bootcount > 2){
    Serial.println(" Booting into Recovery Mode");
    String recoveryDetails = "State: " + String(espData.program.state) + ", Boot count: " + String(espData.program.bootcount);
    logStartupState("Boot Mode", "Recovery", recoveryDetails.c_str());
    myLED.setLEDState(LEDState::RECOVERY_MODE);
    recoveryBoot();
  } else {
    String normalDetails = "State: " + String(espData.program.state) + ", Boot count: " + String(espData.program.bootcount);
    logStartupState("Boot Mode", "Normal", normalDetails.c_str());
    normalboot();
  }
  
  // Serial command interface ready
  Serial.println("\n=== Serial Command Interface Ready ===");
  Serial.println("Type 'help' for available commands");
  Serial.print("> ");
  
  // Start Wifi AP and Webserver for diagnostics
  // espConfig.wifiCfg.state = espWifi.connect();

}

/**
 * @brief Main Arduino loop function - continuous system operation
 * 
 * @details This function runs continuously after setup() completes and provides:
 *          - Serial command processing for runtime system control
 *          - Periodic debug output for system monitoring (every 5 seconds)
 *          - System health monitoring and status updates
 * 
 *          The loop maintains system responsiveness while providing regular
 *          status feedback through the serial interface. All real-time operations
 *          and hardware interfaces are managed through interrupt handlers and
 *          background tasks.
 * 
 * @note Called continuously by Arduino framework - keep execution time minimal
 * @see setup(), handleSerialCommands(), debugPrint()
 */
void loop(){
  
  // Handle serial commands
  // handleSerialCommands();
  
  // Only debug print occasionally and check free heap
  // static unsigned long lastDebugPrint = 0;
  // unsigned long currentMillis = millis();
  
  // if (currentMillis - lastDebugPrint >= 10000) { // Every 10 seconds instead of 5
  //   if (ESP.getFreeHeap() > 50000) { // Only if we have sufficient free heap
  //     debugPrint();
  //     lastDebugPrint = currentMillis;
  //   } else {
  //     webSerial("Low memory warning: " + String(ESP.getFreeHeap()) + " bytes free\n");
  //     lastDebugPrint = currentMillis;
  //   }
  // }
  
  delay(1000); // Reduce to 1 second delay for better responsiveness
}
#pragma endregion